class YemenLocations {
  static const Map<String, List<String>> provincesAndDistricts = {
    'صنعاء': [
      'الوحدة',
      'التحرير',
      'الصافية',
      'شعوب',
      'السبعين',
      'معين',
      'آزال',
      'الثورة',
      'بني الحارث',
      'همدان',
    ],
    'عدن': [
      'المعلا',
      'كريتر',
      'الشيخ عثمان',
      'المنصورة',
      'دار سعد',
      'البريقة',
      'خور مكسر',
      'التواهي',
    ],
    'تعز': [
      'القاهرة',
      'صالة',
      'المظفر',
      'الموسكي',
      'وادي القاضي',
      'المسراخ',
      'الشمايتين',
    ],
    'الحديدة': [
      'الحوك',
      'الميناء',
      'الحالي',
      'الزيدية',
      'باجل',
      'الزهرة',
    ],
    'إب': [
      'إب المدينة',
      'حبيش',
      'جبلة',
      'يريم',
      'السدة',
      'البخاري',
    ],
    'ذمار': [
      'ذمار المدينة',
      'عنس',
      'مغرب عنس',
      'جهران',
    ],
    'حضرموت': [
      'المكلا',
      'الشحر',
      'سيئون',
      'تريم',
      'الغيل',
    ],
    'عمران': [
      'مدينة حبابة',
      'عمران',
      '',
      '',
    ],
  };

  static List<String> getProvinces() {
    return provincesAndDistricts.keys.toList();
  }

  static List<String> getDistricts(String province) {
    return provincesAndDistricts[province] ?? [];
  }
}
